# Package built 
#### Packiging

In [ ]:
from square_number import Square
a = Square()
a.square(5)

25

In [ ]:
from private_data import Private
c = Private()
c.count(12)

In [ ]:
c.display()

112

## Run from Package

In [ ]:
!python /content/addition_of_two.py

20

in above when we import a module then definitly create a class package. and in bellow when we use !python then it is not mendatory to create a class package.. we can do it with function also

## Unit Testing and Assert

#### assertFalse, assertTrue, assertEqual are in unittest

In [ ]:
!python test.py

...F.F
======================================================================
FAIL: test_25 (__main__.Tests)
Check that 25 is not prime.
----------------------------------------------------------------------
Traceback (most recent call last):
  File "test.py", line 26, in test_25
    self.assertFalse(is_prime(25))
AssertionError: True is not false

======================================================================
FAIL: test_8 (__main__.Tests)
Check that 8 is not prime.
----------------------------------------------------------------------
Traceback (most recent call last):
  File "test.py", line 18, in test_8
    self.assertFalse(is_prime(8))
AssertionError: True is not false

----------------------------------------------------------------------
Ran 6 tests in 0.001s

FAILED (failures=2)

### Function into function or Nested function

In [ ]:
def plus(number):
  def addition(number):
    number +=1
    return number

  result = addition(number)
  return result

plus(5)

6

## Passing arguments as function

In [ ]:
def plus(number):
  return number+1

def addition(addi):
  n = int(input())
  number_to_add =n
  return addi(number_to_add)

addition(plus)

15

16

In [ ]:
def square(a,b):
  return a**b

def display(function):
  a = int(input())
  b = int(input())
  return function(a,b)


print(f"Square of 4 is {display(square)}")

4
2
Square of 4 is 16

## Function returning other function

In [ ]:
def greatings():
  def ankur():
    return "Hi To All"
  return ankur

greatings()

generator object are being created when we just call main function of greatings then what should we do to print the returing value that are in bellow-->

when a function returing a funtion then we have to create an object of that function. In this case we create an object of greatings() function as great and call great() as function

In [ ]:
great = greatings()
great()

'Hi To All'

### Nested function do the work with the main function value or argument

In [ ]:
def function1(message):
  "Enclosing Function"
  def function2():
    "Nested Function"
    print(message)

  function2()
function1("Some Message")

Some Message

In [ ]:
def addition(num1, num2):
  def add():
    print(num1+num2)

  add()

addition(4,5)

9

## Decorator

In [ ]:
# creating decorator
def uppercase_decorator(function):
  def wrapper():
    func= function()
    upper = func.upper()
    return upper

  return wrapper

In [ ]:
def great():
  return "Hello, I am Ankur"

In [ ]:
decorator = uppercase_decorator(great)
decorator()

'HELLO, I AM ANKUR'

In [ ]:
def lowercase_function(function):
    def wrapper():
        func = function()
        make_lower = func.lower()
        return make_lower
    return wrapper
def great():
    return "I AM ANKUR"
decorator = lowercase_function(great)
decorator()

'i am ankur'

In [ ]:
@uppercase_decorator
def great():
  return "Hi There"

great()

'HI THERE'

In [ ]:
@lowercase_function
def string():
  return "YOU ARE WRONG ABOUT ME"
string()

'you are wrong about me'

In [ ]:
def split_function(function):
  def wrapper():
    func = function()
    spliting = func.split()
    return spliting
  return wrapper

In [ ]:
@split_function
@lowercase_function
def great():
  return "YOU ARE WRONG ABOUT ME"

great()

['you', 'are', 'wrong', 'about', 'me']

In [ ]:
import functools
def uppercase_decorator2(func):
  @functools.wraps(func)
  def wrapper():
    return func().upper()
  return wrapper

In [ ]:
@uppercase_decorator2
def great():
  return "Say Hi"

great()

'SAY HI'

### reduce function

In [ ]:
import functools
import operator
list1 = [1,3,4,5,6,8]
print(f"The adding elements results: {functools.reduce(operator.add,list1)}")

The adding elements results: 27

##### without operator using lambda function

In [ ]:
import functools
print(f"the results of addition of list1 is : {functools.reduce(lambda a,b: a+b,list1)}")

the results of addition of list1 is : 27

## ***Pandas***
#### it is a data frame . and we can analysis by using it

#### manual dataframe creating

In [ ]:
# pandas is an important thing in data science. Big projects are going use pandas.
import pandas as pd
df = pd.DataFrame()
df['a'] = [1,2,3]  # we are manually create data frame but we are going use csv file for dataframe
df['b'] = [4,5,6]
df

   a  b
0  1  4
1  2  5
2  3  6

In [ ]:
df = pd.DataFrame({'a':[1,2,3], 'b':[4,6,7]})
df

   a  b
0  1  4
1  2  6
2  3  7

In [ ]:
type(df)

pandas.core.frame.DataFrame

#### Dataframe manual indexing

In [ ]:
df= pd.DataFrame({'a': [1,3,3], 'b': [4,5,6]}, index=[1,2,3])
df

   a  b
1  1  4
2  3  5
3  3  6

#### outside column nameing

In [ ]:
df= pd.DataFrame([[1,3,3], [4,5,6]], index=[1,2], columns=['a','b','c'])
df

   a  b  c
1  1  3  3
2  4  5  6

In [ ]:
df= pd.DataFrame([[1,4],[3,5] ,[3,6]], index=[1,2,3], columns=['a','b'])
df

   a  b
1  1  4
2  3  5
3  3  6

#### drop duplicates from DataFrame

In [ ]:
df= pd.DataFrame([[1,4],[3,5] ,[3,6],[3,6]], index=[1,2,3,4], columns=['a','b'])
df

   a  b
1  1  4
2  3  5
3  3  6
4  3  6

In [ ]:
df=df.drop_duplicates()

In [ ]:
df

   a  b
1  1  4
2  3  5
3  3  6

### Dataframe Melting

In [ ]:
pd.melt(df)

  variable  value
0        a      1
1        a      3
2        a      3
3        b      4
4        b      5
5        b      6

### Two Dataframe concatination

In [ ]:
df

   a  b
1  1  4
2  3  5
3  3  6

In [ ]:
df1 = pd.DataFrame({'a':[4,5], 'b':[6,7]}, index=[1,2])
df1

   a  b
1  4  6
2  5  7

In [ ]:
df2=pd.concat([df,df1])

In [ ]:
df2

   a  b
1  1  4
2  3  5
3  3  6
1  4  6
2  5  7

In [ ]:
#df2 = pd.DataFrame(index=[1,2,3,4,5])

In [ ]:
df2=df2.reset_index()

In [ ]:
df2

   index  a  b
0      1  1  4
1      2  3  5
2      3  3  6
3      1  4  6
4      2  5  7

In [ ]:
# we have remove index from above result
df2=df2.drop(['index'],axis=1)

In [ ]:
df2

   a  b
0  1  4
1  3  5
2  3  6
3  4  6
4  5  7

### Concatination 2.0

In [ ]:
df3 = pd.DataFrame([[2,3],[4,5],[6,7]], index=[1,2,3], columns=['a','b'])
df4 = pd.DataFrame([[2,3],[4,5]], index=[1,2], columns=['c','d'])

In [ ]:
df3

   a  b
1  2  3
2  4  5
3  6  7

In [ ]:
df4

   c  d
1  2  3
2  4  5

In [ ]:
df5=pd.concat([df3,df4],axis=1)

In [ ]:
df5

   a  b    c    d
1  2  3  2.0  3.0
2  4  5  4.0  5.0
3  6  7  NaN  NaN

axis=1 is columns and axis=0 means rows

In [ ]:
list(df5['d'])

[3.0, 5.0, nan]

In [ ]:
df5[df5['b']==3]

   a  b    c    d
1  2  3  2.0  3.0

In [ ]:
df5[df5['b']==3]['b'][:1]

1    3
Name: b, dtype: int64

In [ ]:
df5[df5['b']>=5]['a']

2    4
3    6
Name: a, dtype: int64

In [ ]:
df5[df5['b']>=5]['a'][:1]

2    4
Name: a, dtype: int64

#### from above program we can do it as using loc[ ]

In [ ]:
df5.loc[df5.b>=5].a

2    4
3    6
Name: a, dtype: int64

In [ ]:
df5.loc[(df5.b>3) & (df5.b<7)]

   a  b    c    d
2  4  5  4.0  5.0

In [ ]:
df5[-2:]

   a  b    c    d
2  4  5  4.0  5.0
3  6  7  NaN  NaN

In [ ]:
df5.loc[(df5.b>3) & (df5.b<7),['c','d']]

     c    d
2  4.0  5.0

###### we can do it without loc

In [ ]:
df5[(df5.b>3) & (df5.b<7)]['d']

2    5.0
Name: d, dtype: float64

In [ ]:
df5

   a  b    c    d
1  2  3  2.0  3.0
2  4  5  4.0  5.0
3  6  7  NaN  NaN

In [ ]:
df5.sort_values('a')

   a  b    c    d
1  2  3  2.0  3.0
2  4  5  4.0  5.0
3  6  7  NaN  NaN

#### Sorting DataFrame

In [ ]:
dff = pd.DataFrame([[7,3],[2,3],[9,10],[1,2]], index=[1,2,3,4], columns=['a','b'])
dff

   a   b
1  7   3
2  2   3
3  9  10
4  1   2

In [ ]:
dff.sort_values('b')

   a   b
4  1   2
1  7   3
2  2   3
3  9  10

In [ ]:
dff.sort_values('a')

   a   b
4  1   2
2  2   3
1  7   3
3  9  10

In [ ]:
print(df1)

   a  b
1  4  6
2  5  7

In [ ]:
print(df2)

   a  b
0  1  4
1  3  5
2  3  6
3  4  6
4  5  7

In [ ]:
print(df3)

   a  b
1  2  3
2  4  5
3  6  7

In [ ]:
print(df4)

   c  d
1  2  3
2  4  5

In [ ]:
print(df5)

   a  b    c    d
1  2  3  2.0  3.0
2  4  5  4.0  5.0
3  6  7  NaN  NaN

In [ ]:
dff

   a   b
1  7   3
2  2   3
3  9  10
4  1   2

In [ ]:
dff= dff.sort_values('a', ascending=False) # for descending order

In [ ]:
dff

   a   b
3  9  10
1  7   3
2  2   3
4  1   2

In [ ]:
dff = dff.sort_index()
dff

   a   b
1  7   3
2  2   3
3  9  10
4  1   2

#### Replacing NaN value to some other VAlues

In [ ]:
df5

   a  b    c    d
1  2  3  2.0  3.0
2  4  5  4.0  5.0
3  6  7  NaN  NaN

In [ ]:
df6 = df5.fillna(6)

In [ ]:
df6

   a  b    c    d
1  2  3  2.0  3.0
2  4  5  4.0  5.0
3  6  7  6.0  6.0

In [ ]:
df5

   a  b    c    d
1  2  3  2.0  3.0
2  4  5  4.0  5.0
3  6  7  NaN  NaN

### new dataframe

In [2]:
import pandas as pd
import numpy as np
data = pd.DataFrame({
    'age': [10,22,13,21,12,11,17],
    'section': ['A','B','C','B','B','A','A'],
    'city': ['Dhaka', 'Rangpur', 'Dinajpur', 'Dinajpur', 'Dinajpur', 'Dhaka','Khulna'],
    'gender': ['m', 'f', 'f', 'm', 'f', 'm', 'm'],
    'favourite_color': ['red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
})

In [3]:
data

   age section      city gender favourite_color
0   10       A     Dhaka      m             red
1   22       B   Rangpur      f             NaN
2   13       C  Dinajpur      f          yellow
3   21       B  Dinajpur      m             NaN
4   12       B  Dinajpur      f           black
5   11       A     Dhaka      m           green
6   17       A    Khulna      m             red

In [ ]:
data.sort_values("age")

   age section      city gender favourite_color
0   10       A     Dhaka      m             red
5   11       A     Dhaka      m           green
4   12       B  Dinajpur      f           black
2   13       C  Dinajpur      f          yellow
6   17       A    Khulna      m             red
3   21       B  Dinajpur      m             NaN
1   22       B   Rangpur      f             NaN

In [ ]:
data['city'].value_counts()

Dinajpur    3
Dhaka       2
Rangpur     1
Khulna      1
Name: city, dtype: int64

In [ ]:
data['age'].value_counts()

13    1
12    1
11    1
10    1
22    1
21    1
17    1
Name: age, dtype: int64

In [ ]:
data['gender'].value_counts()

m    4
f    3
Name: gender, dtype: int64

#### NaN value droping 
#####  dropna() droping total row

In [ ]:
df5

   a  b    c    d
1  2  3  2.0  3.0
2  4  5  4.0  5.0
3  6  7  NaN  NaN

In [ ]:
df5.dropna()

   a  b    c    d
1  2  3  2.0  3.0
2  4  5  4.0  5.0

In [ ]:
df5[-2:]

   a  b    c    d
2  4  5  4.0  5.0
3  6  7  NaN  NaN

### Value Assigning in data city

In [4]:
data['city'][4]='Dhaka'

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [5]:
data

   age section      city gender favourite_color
0   10       A     Dhaka      m             red
1   22       B   Rangpur      f             NaN
2   13       C  Dinajpur      f          yellow
3   21       B  Dinajpur      m             NaN
4   12       B     Dhaka      f           black
5   11       A     Dhaka      m           green
6   17       A    Khulna      m             red

In [6]:
data['city'].value_counts()

Dhaka       3
Dinajpur    2
Rangpur     1
Khulna      1
Name: city, dtype: int64

In [7]:
data[data['city']=='Dhaka']['city']

0    Dhaka
4    Dhaka
5    Dhaka
Name: city, dtype: object

In [8]:

data

   age section      city gender favourite_color
0   10       A     Dhaka      m             red
1   22       B   Rangpur      f             NaN
2   13       C  Dinajpur      f          yellow
3   21       B  Dinajpur      m             NaN
4   12       B     Dhaka      f           black
5   11       A     Dhaka      m           green
6   17       A    Khulna      m             red

In [9]:
index = 0
for i in data.values:
  # print(i)
    
    if i[2]=='Dhaka':
      # print(i[2])
        
        data['city'][index]="Rajshahi"
    index+=1

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [10]:
data

   age section      city gender favourite_color
0   10       A  Rajshahi      m             red
1   22       B   Rangpur      f             NaN
2   13       C  Dinajpur      f          yellow
3   21       B  Dinajpur      m             NaN
4   12       B  Rajshahi      f           black
5   11       A  Rajshahi      m           green
6   17       A    Khulna      m             red

#### Without Knowing the index which i am going to change how we are going to do that given in bellow->

In [14]:
for i in data:
  print(i)

age
section
city
gender
favourite_color

##### find out the city index

In [17]:
list(data.columns).index('city')

2

In [18]:
data

   age section      city gender favourite_color
0   10       A  Rajshahi      m             red
1   22       B   Rangpur      f             NaN
2   13       C  Dinajpur      f          yellow
3   21       B  Dinajpur      m             NaN
4   12       B  Rajshahi      f           black
5   11       A  Rajshahi      m           green
6   17       A    Khulna      m             red

In [19]:
data['city']

0    Rajshahi
1     Rangpur
2    Dinajpur
3    Dinajpur
4    Rajshahi
5    Rajshahi
6      Khulna
Name: city, dtype: object

###### then from the city index which have been found in given in the city_index and from for loop i is columns value we gave that index to it and when found or meet the condition then perform it.->

In [20]:
index = 0 
city_index= list(data.columns).index('city')
for i in data.values:
  if i[city_index]=='Rajshahi':
    data['city'][index]='Dhaka'

  index+=1

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [21]:
data

   age section      city gender favourite_color
0   10       A     Dhaka      m             red
1   22       B   Rangpur      f             NaN
2   13       C  Dinajpur      f          yellow
3   21       B  Dinajpur      m             NaN
4   12       B     Dhaka      f           black
5   11       A     Dhaka      m           green
6   17       A    Khulna      m             red

#### Sample()

In [25]:
data.sample(frac=0.5)

   age section      city gender favourite_color
5   11       A     Dhaka      m           green
1   22       B   Rangpur      f             NaN
2   13       C  Dinajpur      f          yellow
6   17       A    Khulna      m             red

In [26]:
data.sample(n=5)

   age section      city gender favourite_color
4   12       B     Dhaka      f           black
6   17       A    Khulna      m             red
3   21       B  Dinajpur      m             NaN
0   10       A     Dhaka      m             red
5   11       A     Dhaka      m           green

In [27]:
data[data.age>15]

   age section      city gender favourite_color
1   22       B   Rangpur      f             NaN
3   21       B  Dinajpur      m             NaN
6   17       A    Khulna      m             red

#### Unique()

In [28]:
data['section'].unique()

array(['A', 'B', 'C'], dtype=object)

In [29]:
data['section'].value_counts()

B    3
A    3
C    1
Name: section, dtype: int64

#### describe()

In [31]:
data

   age section      city gender favourite_color
0   10       A     Dhaka      m             red
1   22       B   Rangpur      f             NaN
2   13       C  Dinajpur      f          yellow
3   21       B  Dinajpur      m             NaN
4   12       B     Dhaka      f           black
5   11       A     Dhaka      m           green
6   17       A    Khulna      m             red

In [30]:
data.describe()

             age
count   7.000000
mean   15.142857
std     4.879500
min    10.000000
25%    11.500000
50%    13.000000
75%    19.000000
max    22.000000

#### info()

In [32]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              7 non-null      int64
 1   section          7 non-null      object
 2   city             7 non-null      object
 3   gender           7 non-null      object
 4   favourite_color  5 non-null      object
dtypes: int64(1), object(4)
memory usage: 408.0+ bytes

#### head() and tail()

In [33]:
data.head()

   age section      city gender favourite_color
0   10       A     Dhaka      m             red
1   22       B   Rangpur      f             NaN
2   13       C  Dinajpur      f          yellow
3   21       B  Dinajpur      m             NaN
4   12       B     Dhaka      f           black

In [34]:
data.tail()

   age section      city gender favourite_color
2   13       C  Dinajpur      f          yellow
3   21       B  Dinajpur      m             NaN
4   12       B     Dhaka      f           black
5   11       A     Dhaka      m           green
6   17       A    Khulna      m             red

In [35]:
data.head(1)

   age section   city gender favourite_color
0   10       A  Dhaka      m             red

In [36]:
data.tail(2)

   age section    city gender favourite_color
5   11       A   Dhaka      m           green
6   17       A  Khulna      m             red

#### shape

In [38]:
data.shape

(7, 5)

7 row and 5 columns

#### rename()

In [40]:
data.rename(columns={'section': "sec"})

   age sec      city gender favourite_color
0   10   A     Dhaka      m             red
1   22   B   Rangpur      f             NaN
2   13   C  Dinajpur      f          yellow
3   21   B  Dinajpur      m             NaN
4   12   B     Dhaka      f           black
5   11   A     Dhaka      m           green
6   17   A    Khulna      m             red

In [41]:
data

   age section      city gender favourite_color
0   10       A     Dhaka      m             red
1   22       B   Rangpur      f             NaN
2   13       C  Dinajpur      f          yellow
3   21       B  Dinajpur      m             NaN
4   12       B     Dhaka      f           black
5   11       A     Dhaka      m           green
6   17       A    Khulna      m             red

#### corr()  == corilation of a dataframe

In [42]:
data.corr()

     age
age  1.0